# ДНК представляет из себя последовательность (строку) из чередований четырёх молекул (букв): аденин (A), цитозин (C), гуанин (G), тимин (T). РНК же состоит из чередований аденина (A), цитозина (C), гуанина (G) и урацила (U). При транскрипции ДНК в РНК, аденин переходит в урацил, цитозин - в гуанин, гуанин - в цитозин, тимин - в аденин. Ваша задача написать функцию, которая по последовательности ДНК (например, 'AGCTAT') вычисляет последовательность РНК (соответственно 'UCGAUA').
def to_rna(dna_strand):
    """Вычисляет результат транскрипции РНК
    :param dna_strand: строка ДНК из символов ACGT
    :return: строка РНК из символов UGCA
    """
    dna_strand = str(dna_strand)
    result = ""
    for nucl in dna_strand:
        if (nucl == 'A'):
            result += "U"

        elif (nucl == 'G'):
            result += "C"

        elif (nucl == 'C'):
            result += "G"

        elif (nucl == 'T'):
            result += "A"

    return result
